import streamlit as st

#ส่วนที่ 1 หัวข้อของหน้าเว็บ (Title สีแดง)
st.markdown("# :red[คํานวนค่าดัชนีมวลกาย BMI]")
st.write("กรอกข้อมูลนํ้าหนักและส่วนสูงของคุณ เพื่อเช็กสุขภาพเบื้องต้น")

#ส่วนที่ 2 สร้างช่องรับค่านํ้าหนัก และ ส่วนสูง
weight = st.number_input("กรอกนํ้าหนักของคุณ (กิโลกรัม):", min_value=1.0)
height_cm = st.number_input("กรอกส่วนสูงของคุณ (เซนติเมตร):", min_value=1.0)

#ส่วนที่ 3 สร้างปุ่มกดคํานวณ
if st.button("คํานวณค่า BMI"):
 # แปลงส่วนสูงจาก cm เป็น เมตร แล้วคํานวณ BMI
 height_m = height_cm / 100
bmi = weight / (height_m ** 2)

st.write("---")
st.header(f"ค่า BMI ของคุณคือ: **{bmi:.2f}**")

#ส่วนที่ 4 แปลงผลค่า BMI ตามเกณฑ์
if bmi < 18.5:
 st.warning("คุณมีนํ้าหนักน้อยกว่าเกณฑ์ (ผอม)")
elif 18.5 <= bmi < 23.0:
 st.success("คุณมีนํ้าหนักอยู๋ในเกณฑ์ปกติ (สุขภาพดี)")
elif 23.0 <= bmi < 25.0:
 st.info("คุณเริ่มมีนํ้าหนักเกินเกณฑ์ (ท้วม)")
else:
 st.error("คุณอยู่ในเกณฑ์อ้วน ควรระวังเรื่องสุขภาพและออกกําลังกาย")

st.driver()
st.write("นายกฤษณกันตินันท์ ณ นคร เลขที่ 31 ม.4/15")
